---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.AssociatedParameters
source: html/7c53d717-b977-3ce3-2ee8-ecf2da61ffb5.htm
---
# Autodesk.Revit.DB.FamilyParameter.AssociatedParameters Property

The parameters from elements in the family which are associated to this parameter.

## Syntax (C#)
```csharp
public ParameterSet AssociatedParameters { get; }
```